titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [128]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
import pandas as pd
import pandas as np

df_titanic =pd.read_csv("train.csv")
display(df_titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [129]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [130]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic['Survived']==0]['Age'].mean()

30.62617924528302

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [15]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
mean=df_titanic[df_titanic['Survived']==0]['Fare'].mean()
median=df_titanic[df_titanic['Survived']==0]['Fare'].median()
print("Mean:",mean," Median:", median)

Mean: 22.117886885245877  Median: 10.5

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [36]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız

df_titanic[(df_titanic['Survived']==0) & (df_titanic.Sex =='male')].Age.mean()

31.618055555555557

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [37]:
df_titanic[(df_titanic.Survived==0) & (df_titanic.Sex=="female")].Age.mean()

25.046875

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [5]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic['Survived']==1]['Age'].mean()

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [6]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
mean=df_titanic[df_titanic['Survived']==1]['Fare'].mean()
median=df_titanic[df_titanic['Survived']==1]['Fare'].median()
print("Mean:",mean," Median:", median)

Kazadan kurtulan toplam kişi sayısını bulunuz

In [39]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic["Survived"].value_counts()[1]

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [40]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic['Survived']==1) & (df_titanic.Sex =='male')].Age.mean()

27.276021505376345

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [155]:
df_titanic[(df_titanic.Survived==1) & (df_titanic.Sex=="female")].Age.mean()

28.84771573604061

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [50]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız

df_titanic[df_titanic['Age'] < 10]['Fare'].median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [51]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic['Age'] > 10]['Fare'].median()

13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [52]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız

display(df_titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [69]:
df_titanic.groupby('Pclass').Survived.value_counts()

Pclass  Survived
1       1           136
        0            80
2       0            97
        1            87
3       0           372
        1           119
Name: Survived, dtype: int64

In [103]:
death1 = df_titanic.query('Pclass ==1 and Survived==0')
total1 = df_titanic.query('Pclass==1')
death2 = df_titanic.query('Pclass ==2 and Survived==0')
total2 = df_titanic.query('Pclass==2')
death3 = df_titanic.query('Pclass ==3 and Survived==0')
total3 = df_titanic.query('Pclass==3')

first_class_death_rate  = len(death1)/len(total1)
second_class_death_rate = len(death2)/len(total2)
third_class_death_rate  = len(death3)/len(total3)

print(first_class_death_rate,second_class_death_rate,third_class_death_rate)

0.37037037037037035 0.5271739130434783 0.7576374745417516

In [104]:
print("3.sınıf biletli yolcuların ölüm oranı en yüksektir,bunu sırayla 2.sınıf ve 1.sınıf takip eder.Sınıf yükseldikçe ölüm oranı azalıyor.")

3.sınıf biletli yolcuların ölüm oranı en yüksektir,bunu sırayla 2.sınıf ve 1.sınıf takip eder.Sınıf yükseldikçe ölüm oranı azalıyor.

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [109]:
df_titanic[(df_titanic["Pclass"]==1)]["Fare"].mean(),df_titanic[(df_titanic["Pclass"]==2)]["Fare"].mean(),df_titanic[(df_titanic["Pclass"]==3)]["Fare"].mean()

(84.15468749999992, 20.66218315217391, 13.675550101832997)

In [116]:
print('1.sınıf yolcuların bilet fiyatları en yüksektir')

1.sınıf yolcuların bilet fiyatları en yüksektir

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [159]:
dead_woman = len(df_titanic[(df_titanic['Survived']==0) & (df_titanic['Sex']== 'female')].index)
total_woman = len(df_titanic[(df_titanic['Sex']== 'female')].index)

death_rate_of_woman = dead_woman / total_woman

death_rate_of_woman

0.25796178343949044

In [158]:
dead_man = len(df_titanic[(df_titanic['Survived']==0) & (df_titanic['Sex']== 'male')].index)
total_man = len(df_titanic[(df_titanic['Sex']== 'male')].index)

death_rate_of_man = dead_man / total_man

death_rate_of_man

0.8110918544194108

In [143]:
print("Kazada erkek olum orani daha yuksektir.Yaklaşık olarak 4 kat fazladır.\nBunun nedeni öncelikli olarak kurtarılmaya çalışanların kadınlar ve çocuklar olabilir. ")

Kazada erkek olum orani daha yuksektir.Yaklaşık olarak 4 kat fazladır.
Bunun nedeni öncelikli olarak kurtarılmaya çalışanların kadınlar ve çocuklar olması

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [156]:
not_survived_fare = df_titanic[(df_titanic["Survived"]== 0) & (df_titanic["Sex"] == "male")].Fare.mean()
survived_fare = df_titanic[(df_titanic["Survived"]== 1) & (df_titanic["Sex"] == "male")].Fare.mean()

print('Ölen erkeklerin ortalama bilet fiyatı:', not_survived_fare )
print('Kurtulan erkeklerin ortalama bilet fiyatı:' , survived_fare)

Ölen erkeklerin ortalama bilet fiyatı: 21.960992948717944
Kurtulan erkeklerin ortalama bilet fiyatı: 40.82148440366974

In [157]:
print('Kurtulan erkeklerin ortalama bilet fiyatı,ölen erkeklerin ortalama bilet fiyatından daha yüksektir.')

Kurtulan erkeklerin ortalama bilet fiyatı,ölen erkeklerin ortalama bilet fiyatından daha yüksektir.

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [152]:
df_titanic_missing = pd.read_csv("train_missing.csv")
display(df_titanic_missing)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [154]:
df_titanic_missing.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked       173
dtype: int64

In [166]:
#df_titanic_missing datamın kopyasını alıyorum
df_titanic_missing_copy1 = df_titanic_missing.copy()

In [167]:
df_titanic_missing_copy1.Age = df_titanic_missing_copy1.Age.fillna(value=df_titanic_missing_copy1.Age.mean()) #age kolonunu hesapladıgım mean değeriyle dolduruyorum

In [169]:
df_titanic_missing_copy1.Age.isnull().sum()

0

In [173]:
df_titanic_missing_copy1.Embarked.mode()

0    S
dtype: object

In [176]:
df_titanic_missing_copy1.Embarked = df_titanic_missing_copy1.Embarked.fillna(df_titanic_missing_copy1.Embarked.mode()[0])

In [175]:
df_titanic_missing_copy1.Embarked.isnull().sum()

0

In [170]:
df_titanic_missing_copy1.Fare.mean()

31.844821874999965

In [171]:
df_titanic_missing_copy1.Fare = df_titanic_missing_copy1.Fare.fillna(df_titanic_missing_copy1.Fare.mean()) #fare ortalama değeri ile doldurdum

In [172]:
df_titanic_missing_copy1.Fare.isnull().sum()

0

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [203]:
# missing value değeri mode ile doldurulabilir.

df_titanic_missing["SibSp"].fillna(df_titanic_missing["SibSp"].mode() [0] , inplace = True)

In [204]:
df_titanic_missing["SibSp"].isnull().sum()

0

In [ ]:
#normalde kategorik bir değer değil ama denediklerim arasında en uygunu mode olarak çıktı.

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [177]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic_missing_new = pd.read_csv("train_missing.csv")

In [180]:
display(df_titanic_missing_new)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [181]:
df_titanic_missing_new["Embarked"].fillna(value="NAN",inplace=True)

In [185]:
df_titanic_missing_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        721 non-null    float64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         800 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(3), int64(4), object(5)
memory usage: 83.7+ KB

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [186]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız

df_titanic_missing_new.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked         0
dtype: int64

In [191]:
#boş fare değerlerinin indisleri
bos = df_titanic_missing_new.Fare[df_titanic_missing_new.Fare.isnull()].index.to_list()
bos

[11,
 12,
 17,
 35,
 40,
 45,
 67,
 69,
 70,
 97,
 105,
 113,
 129,
 162,
 166,
 175,
 181,
 182,
 193,
 206,
 210,
 215,
 229,
 255,
 264,
 267,
 283,
 296,
 301,
 308,
 324,
 332,
 354,
 390,
 396,
 404,
 413,
 417,
 427,
 430,
 436,
 437,
 438,
 440,
 443,
 456,
 463,
 490,
 494,
 504,
 533,
 562,
 589,
 596,
 599,
 608,
 614,
 617,
 618,
 627,
 654,
 659,
 676,
 679,
 681,
 684,
 690,
 695,
 721,
 722,
 729,
 748,
 752,
 757,
 763,
 773,
 781,
 783,
 790,
 794,
 798,
 806,
 808,
 822,
 823,
 825,
 841,
 863,
 872,
 885,
 888]

In [196]:
#nan yerine median konuldu
df_titanic_missing_new.Fare.fillna(value = df_titanic_missing_new.Fare.median(), inplace = True)

In [197]:
#fare_missing değişkeni üret
df_titanic_missing_new.insert(10,"Fare_Missing",0)

In [198]:
#bos içindeki indisler nan ise 1 yapıldı
df_titanic_missing_new.loc[bos, "Fare_Missing"] = 1

In [199]:
display(df_titanic_missing_new)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Fare_Misssing,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.25000,0,0,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.28330,0,0,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.92500,0,0,NaN,NAN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.10000,0,0,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.05000,0,0,NaN,NAN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.00000,0,0,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.00000,0,0,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,14.45625,1,0,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.00000,0,0,C148,NAN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.75000,0,0,NaN,Q